CSI API ETABS v1
cDesignStrip.SetGUID Method
 Sets the GUID of an existing strip
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGUID(
	string Name,
	string GUID = ""
)
Function SetGUID (
	Name As String,
	Optional GUID As String = ""
) As Integer
Dim instance As cDesignStrip
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetGUID(Name, GUID)
int SetGUID(
	String^ Name,
	String^ GUID = L""
)
abstract SetGUID :
        Name : string *
        ?GUID : string
(* Defaults:
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of the strip
GUID (Optional)
Type: System.String
 The desired GUID for the strip. If this argument is left blank, the program will assign a new randomly-created GUID
Return Value
Type: Int32
 Returns zero if the function executes correctly, otherwise it returns a nonzero value.
See Also
Reference
cDesignStrip Interface
ETABSv1 Namespace